test/good/optimal-math-function-1.cfg.dot
digraph "optimal-math-function-1" {
    node [shape=box];
    subgraph "cluster_toCall" {
        label="toCall";
        "toCall_142" [label="return 42",style=filled,fillcolor="#66A7DB"];
    }
    subgraph "cluster_test" {
        label="test";
        "test_143" [label="pow(3, 2)"];
        "test_144" [label="pow(3, 1 + 1)"];
        "test_146" [label="pow(3, TWO)"];
        "test_148" [label="pow(3, ONE + ONE)"];
        "test_150" [label="pow(toCall(), toCall())"];
        "test_152" [label="pow(toCall(), toCall() + 1)",style=filled,fillcolor="#66A7DB"];
        "test_143" -> "test_144";
        "test_144" -> "test_146";
        "test_146" -> "test_148";
        "test_148" -> "test_150";
        "test_150" -> "test_152";
    }
}
